formal/proposal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-21 Wed 12:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Formal Verification Steps</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="SS-FORDR-LAP" />
</head>
<body>
<div id="content">
<h1 class="title">Formal Verification Steps</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3b00eb7">1. Formal Verification Steps</a>
<ul>
<li><a href="#org39cbe6d">1.1. Produce Formal Specifications from English Requirements</a></li>
<li><a href="#org97ee718">1.2. Produce Properties of the Modeled System</a></li>
<li><a href="#org3566684">1.3. Produce an Abstract Implementation of the System</a></li>
<li><a href="#orgab2336f">1.4. Prove the Formal Properties For the Abstract Implementation</a></li>
</ul>
</li>
<li><a href="#orgee8c431">2. Formal Verification Examples</a>
<ul>
<li><a href="#orgc85a084">2.1. Maps</a>
<ul>
<li><a href="#org85bd418">2.1.1. Formal Specification of a Map</a></li>
<li><a href="#org4ba36bd">2.1.2. Properties of a Map</a></li>
<li><a href="#org3b83777">2.1.3. Abstract Implementation of a Map</a></li>
<li><a href="#org841db16">2.1.4. Prove Properties for the Abstract Implementation</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The following are steps in formally specifying a system.
</p>

<div id="outline-container-org3b00eb7" class="outline-2">
<h2 id="org3b00eb7"><span class="section-number-2">1</span> Formal Verification Steps</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org39cbe6d" class="outline-3">
<h3 id="org39cbe6d"><span class="section-number-3">1.1</span> Produce Formal Specifications from English Requirements</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Formal specifications are specifications written in a formal language
such as Coq's Gallina. The specification language must be one that can
express propositions and proofs and that is supported by a theorem
prover.
</p>

<p>
The input to the process is an English language description of the system
and its required properties. These must be translated into a formal
specification.
</p>

<p>
The formal specifications will define data types and functions that
will model the system being specified and the functions it performs.
</p>
</div>
</div>

<div id="outline-container-org97ee718" class="outline-3">
<h3 id="org97ee718"><span class="section-number-3">1.2</span> Produce Properties of the Modeled System</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The English language system requirements must be translated into
formal properties using the formal specification language.
These formal requirements will be written in terms of the 
types and functions in the formal specifications.
</p>
</div>
</div>

<div id="outline-container-org3566684" class="outline-3">
<h3 id="org3566684"><span class="section-number-3">1.3</span> Produce an Abstract Implementation of the System</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This step involves producing an implementation of the system
in the specification language that satisfies the given 
requirements. It is not required that the final implementation
follow this abstract implementation. The abstract implementation
is just a witness to the possibility of implementing the system.
</p>
</div>
</div>

<div id="outline-container-orgab2336f" class="outline-3">
<h3 id="orgab2336f"><span class="section-number-3">1.4</span> Prove the Formal Properties For the Abstract Implementation</h3>
<div class="outline-text-3" id="text-1-4">
<p>
This step involves using the theorem prover to prove that the abstract
implementation of the system satisfies the formal properties.
</p>
</div>
</div>
</div>

<div id="outline-container-orgee8c431" class="outline-2">
<h2 id="orgee8c431"><span class="section-number-2">2</span> Formal Verification Examples</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc85a084" class="outline-3">
<h3 id="orgc85a084"><span class="section-number-3">2.1</span> Maps</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A map is a structure that, given an element of the input domain,
will produce an element of the output domain.
</p>
</div>

<div id="outline-container-org85bd418" class="outline-4">
<h4 id="org85bd418"><span class="section-number-4">2.1.1</span> Formal Specification of a Map</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
The following example shows a Coq module type, TableSignature, which
models a lookup table taking natural numbers as keys and
an arbitrary type V as target type.
</p>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #a020f0;">Module Type</span> <span style="color: #0000ff;">TableSignature</span>.
 <span style="color: #a020f0;">Parameter</span> <span style="color: #a0522d;">V</span>: <span style="color: #228b22;">Type</span>.
 <span style="color: #a020f0;">Parameter</span> <span style="color: #a0522d;">default</span>: V.
 <span style="color: #a020f0;">Parameter</span> <span style="color: #a0522d;">table</span>: <span style="color: #228b22;">Type</span>.
 <span style="color: #a020f0;">Definition</span> <span style="color: #0000ff;">key</span> := nat.
 <span style="color: #a020f0;">Parameter</span> <span style="color: #a0522d;">empty</span>: table.
 <span style="color: #a020f0;">Parameter</span> <span style="color: #a0522d;">get</span>: key -&gt; table -&gt; V.
 <span style="color: #a020f0;">Parameter</span> <span style="color: #00008b;">set</span>: key -&gt; V -&gt; table -&gt; table.
<span style="color: #a020f0;">End</span> <span style="color: #0000ff;">TableSignature</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ba36bd" class="outline-4">
<h4 id="org4ba36bd"><span class="section-number-4">2.1.2</span> Properties of a Map</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
The specification in the previous section gave the signature of the
operations but not their semantics. The semantics are given
now in a module type that extends the signature with required
properties.
</p>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #a020f0;">Module Type</span> <span style="color: #0000ff;">TABLE</span>.
 <span style="color: #a020f0;">Include</span> TableSignature.
 <span style="color: #a020f0;">Axiom</span> <span style="color: #a0522d;">gempty</span>: <span style="color: #228b22;">forall</span> <span style="color: #a0522d;">k</span>,   <span style="color: #b22222;">(* </span><span style="color: #b22222;">get-empty </span><span style="color: #b22222;">*)</span>
       get k empty = default.
 <span style="color: #a020f0;">Axiom</span> <span style="color: #a0522d;">gss</span>: <span style="color: #228b22;">forall</span> <span style="color: #a0522d;">k v t</span>,      <span style="color: #b22222;">(* </span><span style="color: #b22222;">get-set-same </span><span style="color: #b22222;">*)</span>
      get k (<span style="color: #00008b;">set</span> k v t) = v.
 <span style="color: #a020f0;">Axiom</span> <span style="color: #a0522d;">gso</span>: <span style="color: #228b22;">forall</span> <span style="color: #a0522d;">j k v t</span>,    <span style="color: #b22222;">(* </span><span style="color: #b22222;">get-set-other </span><span style="color: #b22222;">*)</span>
      j &lt;&gt; k -&gt; get j (<span style="color: #00008b;">set</span> k v t) = get j t.
<span style="color: #a020f0;">End</span> <span style="color: #0000ff;">TABLE</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org3b83777" class="outline-4">
<h4 id="org3b83777"><span class="section-number-4">2.1.3</span> Abstract Implementation of a Map</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
The following code shows a Coq module that provides an implementation
of the TableSignature module type. It uses total maps (implemented in
separate Coq module Maps, not shown) to implement the lookup table.
</p>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #a020f0; text-decoration: underline;">Require Import</span> Maps.

<span style="color: #a020f0;">Module</span> <span style="color: #0000ff;">MapsTableSignature</span> &lt;: TableSignature.
 <span style="color: #a020f0;">Definition</span> <span style="color: #0000ff;">V</span> := <span style="color: #228b22;">Type</span>.
 <span style="color: #a020f0;">Definition</span> <span style="color: #0000ff;">default</span>: V := <span style="color: #228b22;">Prop</span>.
 <span style="color: #a020f0;">Definition</span> <span style="color: #0000ff;">table</span> := total_map V.
 <span style="color: #a020f0;">Definition</span> <span style="color: #0000ff;">key</span> := nat.
 <span style="color: #a020f0;">Definition</span> <span style="color: #0000ff;">empty</span> : table := t_empty default.
 <span style="color: #a020f0;">Definition</span> <span style="color: #0000ff;">get</span> (<span style="color: #a0522d;">k</span>: key) (<span style="color: #a0522d;">m</span>: table) : V := m k.
 <span style="color: #a020f0;">Definition</span> <span style="color: #00008b;">set</span> (<span style="color: #a0522d;">k</span>: key) (<span style="color: #a0522d;">v</span>: V) (<span style="color: #a0522d;">m</span>: table) : table :=
    t_update m k v.
<span style="color: #a020f0;">End</span> <span style="color: #0000ff;">MapsTableSignature</span> .
</pre>
</div>
</div>
</div>

<div id="outline-container-org841db16" class="outline-4">
<h4 id="org841db16"><span class="section-number-4">2.1.4</span> Prove Properties for the Abstract Implementation</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
We place the proofs of the properties in module MapsTable which
extends MapsTableSignature.
</p>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #a020f0;">Module</span> <span style="color: #0000ff;">MapsTable</span> &lt;: TABLE.
 <span style="color: #a020f0;">Include</span> MapsTableSignature.
 <span style="color: #a020f0;">Theorem</span> <span style="color: #0000ff;">gempty</span>: <span style="color: #228b22;">forall</span> <span style="color: #a0522d;">k</span>, get k empty = default.
   <span style="color: #a020f0;">Proof</span>. <span style="color: #00008b;">intros</span>. <span style="color: #ff0000;">reflexivity</span>. <span style="color: #a020f0;">Qed</span>.
 <span style="color: #a020f0;">Theorem</span> <span style="color: #0000ff;">gss</span>: <span style="color: #228b22;">forall</span> <span style="color: #a0522d;">k v t</span>,  get k (<span style="color: #00008b;">set</span> k v t) = v.
   <span style="color: #a020f0;">Proof</span>. <span style="color: #00008b;">intros</span>. <span style="color: #00008b;">unfold</span> get, <span style="color: #00008b;">set</span>. <span style="color: #00008b;">apply</span> t_update_eq. <span style="color: #a020f0;">Qed</span>.
 <span style="color: #a020f0;">Theorem</span> <span style="color: #0000ff;">gso</span>: <span style="color: #228b22;">forall</span> <span style="color: #a0522d;">j k v t</span>, j&lt;&gt;k -&gt; get j (<span style="color: #00008b;">set</span> k v t) = get j t.
   <span style="color: #a020f0;">Proof</span>. <span style="color: #00008b;">intros</span>. <span style="color: #00008b;">unfold</span> get, <span style="color: #00008b;">set</span>. <span style="color: #00008b;">apply</span> t_update_neq.
       <span style="color: #ff0000;">congruence</span>.
   <span style="color: #a020f0;">Qed</span>.
<span style="color: #a020f0;">End</span> <span style="color: #0000ff;">MapsTable</span>.
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: SS-FORDR-LAP</p>
<p class="date">Created: 2018-11-21 Wed 12:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
